// TreeNode.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
// Занин Вячеслав ВМК-21

#include <iostream>
#include "treenode.h"

int main() {
	BinTreeWithFiveNodes <unsigned int>* tree = new BinTreeWithFiveNodes <unsigned int>(4, 6, 7, 8, 9);
	tree->printNodeValue(2);
	tree->~BinTreeWithFiveNodes();
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
